todo_api/app/controllers/tasks_controller.rb

  def index
    tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

  def create
    Task.create(task_params)
---
INSERT INTO "tasks" ("name", "is_done", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "寝る"], ["is_done", 0], ["created_at", "2022-12-27 03:41:13.953043"], ["updated_at", "2022-12-27 03:41:13.953043"]]

    task = Task.find(params[:id])
    task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "is_done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_done", 1], ["updated_at", "2022-12-27 04:23:14.680952"], ["id", 8]]

    task = Task.find(params[:id])
    task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]